# RStudio是R语言常用的集成开发环境（也就是得在这个上面运行啦~），所以第一步得先安装RStudio，小敏的电脑是windows系统，点击下面链接
#                           https://rstudio.com/products/rstudio/download/#download
# 下载R语言和RStudio，下载完成后双击安装按照默认设置一路点一下就安装成功啦，然后打开RStudio，咱们就可以开始R语言学习之旅了
# 先来个上手测试，RStudio左下角有一个Console就是可以即打即输的控制台，学习很方便的，在里面输入
print('hello XiaoMin')
# 然后按回车是不是就看到输出的字符串了~~撒花~~（前边有个[1]表示该行输出开始的序列号，只是提示作用啦）
#-------------------------------------------------数据类型---------------------------------------------------------
# R语言的数据类型有双整型（double，就是实数类型啦）、整型（integer, 就是整数啦）、复数类型（complex)、字符串类型（character）、逻辑型（logical）
# 实数默认为双整型，如果要申明整型可以在整数后边加L
# 字符串类型用于储存文本类型，用单引号' '或双引号" "来包括文本
# 逻辑型就是对（TRUE）或者错（False)啦
# 想知道变量a的数据类型可以用函数typeof(a)
# 给变量赋值可以用"="或者"<-"，在大多数情况两者是相同的
a <- 10; b <- 10L; c <- 10+0i # 等价于 a = 10; b = 10L; c = 10+0i
typeof(a)  # a为双整型，输出为"double"
typeof(b)  # b为整型，输出为"integer"
typeof(c)  # c为复数，输出为"complex"
typeof('hello XiaoMin') # 相当于typeof("hello XiaoMin")，输出为"character"
typeof(3 < 2) # 输出为"logical"
#------------------------------------------------向量及操作-----------------------------------------------------------
# 向量的创建需要使用函数c()，如下
v1 <- c(1996, 3, 18) # 1996 3 18
vs = c('I', 'am', 'a', 'boy') # 还可以创建包含字符串类型元素的向量
# 除了挨个指定数值还有对序列化数值和重复数值的特殊操作
v2 = 2:5 # 2 3 4 5
v3 = seq(2, 3, 0.2) # 2.0 2.2 2.4 2.6 2.8 3.0
v4 = rep(2:4, times=2) # 2 3 4 2 3 4
v5 = rep(2:4, each=2) # 2 3 4 2 3 4
# 上边就是创建相关的啦，如果想用里面的元素需要用到索引
v2[2] # 取v2的第二个元素，3
v2[-2] # 取v2除了第二个元素外的其他所有元素, 2 4 5
v3[2:4] # 取v3的第二到第四个元素, 2.2 2.4 2.6
v3[-(2:4)] # 取v3除了第二到第四个外的其他所有元素，2.0 2.8 3.0
v4[c(1, 5)] # 取v4的第一个和第五个元素，2 3
v4[-c(1, 5)] # 取v4除了第一个和第五个外的其他所有元素，3 4 2 4
v4[v4 == 2] # 取等于2的元素，2 2
v4[v4 > 2] # 取大于2的元素，3 4 3 4
# R语言还提供了向量相关的功能函数
sort(v1) # 给v1中的元素从小到大排序，3 18 1996
rev(v2) # 倒序v2, 5 4 3 2
length(v3) # 求v3的元素个数，6
unique(v4) # 取出v4中包含的元素，2 3 4
#------------------------------------------基本数学运算和条件判断------------------------------------------------------
# 数学操作运算：+ - * / ^
1+2; 1-2; 1*2; 1/2 # 3 1 2 0.5
2^3 # 8
# 其它常用数学运算
log(10) # 求自然对数， 2.302585
exp(1) # 求指数，2.718282
# 向量相关的数学操作
min(v2) # 求向量中的最小元素，2
max(v2) # 求向量中的最大元素，5
sum(v3) # 求和v3中的所有元素，15
mean(v3) # 求v3所有元素的均值，等于sum(v3)/length(v3)，2.5
var(v3) # 求v3中元素的方差，0.14
sd(v3) # 求v3中元素的标准差，0.3741657
# 关系
# 判断等于和不等于的话分别用"=="和"!="
# 判断数值是否大于、大于等于、小于、小于等于分别用">"、 ">="、"<"、"<="
typeof('The moon tonight is extremely round') == 'character'  # TRUE
3 > 2 # TRUE
3 < 2 # FALSE
#------------------------------------------------编程基础-----------------------------------------------------------
# 循环语句（就是在条件满足的情况下循环执行一条或多条语句啦），分为for循环和while循环, for循环的格式是：
# for (variable in sequence) {
#    Do something
# }
# while循环的格式是：
# while(condition) {
#    Do something
# }
# 看下边两个例子就比较清楚啦：
for(i in 0:3) {
  j <- i * 10
  print(j)
} # 0 10 20 30

i = 0
while(i <= 3) {
  j <- i * 10
  print(j)
  i = i + 1
} # 0 10 20 30

# 条件语句（就是在条件满足的情况下才执行啦），格式如下
# if(condition) {
#    Do something
# } else {
#    Do other thing
# }
if(3 > 2) {
  print('3 > 2 is TRUE')
} else {
  print('3 > 2 is FALSE')
}

# 函数定义，格式如下
# function_name <- function(var) {
#    do function
#    return(new_var)
# }
square <- function(x) {
  squared <- x*x
  return(squared)
}
print(square(2)) # 4
#-------------------------------------------------输入输出-----------------------------------------------------------
# 工作目录相关
getwd() # 获取当前工作目录
setwd('C:/Users/liulo/Desktop') # 改变工作目录
# 数据分析通常需要处理大量的数据，数据通常以.txt、.csv或.Rdata的形式储存，此时需要读取或者书写这类格式的文件
df <- read.csv('C:/Users/liulo/Desktop/student.csv')
df['name']
ncol(df) # 3
nrow(df) # 2
mean_score <- mean(df$score) # 75
subset(df, score == max(score))
subset(df, score >= 60)
#------------------------------------------------帮助和教程---------------------------------------------------------
# 小敏如果在使用的过程中碰到哪个函数不理解了可以调用帮助文档来查找，如小敏忘了mean函数的作用可以输入
?mean


